testCase/flowOver2Cylinders/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{   
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    top
    {
        type            slip;
    }
    bottom
    {
        type            slip;
    }
    outlet
    {
        type            zeroGradient;
    }
    cylinder1
    {
        type            noSlip;
    }
    cylinder2
    {
        type            noSlip;
    }
    topFace
    {
        type            empty;
    }
    bottomFace
    {
        type            empty;
    }
    
}


// ************************************************************************* //
